/**
 * Created by pc on 2017/5/12.
 */
/*
*  全国二级城联动 js版
*/
function Dsy(){
    this.Items = {};
}
Dsy.prototype.add = function(id,iArray){
    this.Items[id] = iArray;
}
Dsy.prototype.Exists = function(id){
    if(typeof(this.Items[id]) == "undefined") return false;
    return true;
}

function change(v){
    var str="0";
    for(var i=0;i<v;i++){
        str+=("_"+(document.getElementById(s[i]).selectedIndex-1));
    };
    var ss=document.getElementById(s[v]);
    with(ss){
        length = 0;
        options[0]=new Option(opt0[v],opt0[v]);
        if(v && document.getElementById(s[v-1]).selectedIndex>0 || !v){
            if(dsy.Exists(str)){
                ar = dsy.Items[str];
                for(var i=0;i<ar.length;i++){
                    options[length]=new Option(ar[i],ar[i]);
                }//end for
                if(v){ options[0].selected = true; }
            }
        }//end if v
        if(++v<s.length){change(v);}
    }//End with
}

var dsy = new Dsy();

dsy.add("0",["北京","天津","上海","重庆","河北","山西","内蒙古","辽宁","吉林","黑龙江","江苏","浙江","安徽","福建","江西","山东","河南","湖北","湖南","广东","广西","海南","四川","贵州","云南","西藏","陕西","甘肃","青海","宁夏","新疆"]);
dsy.add("0_0",["北京"]);
dsy.add("0_1",["天津"]);
dsy.add("0_2",["上海"]);
dsy.add("0_3",["重庆"]);
dsy.add("0_4",["石家庄","张家口","承德","秦皇岛","唐山","廊坊","保定","衡水","沧州","邢台","邯郸"]);
dsy.add("0_5",["太原","朔州","大同","阳泉","长治","晋城","忻州","晋中","临汾","吕梁","运城"]);
dsy.add("0_6",["呼和浩特","包头","乌海","赤峰","通辽","呼伦贝尔","鄂尔多斯","乌兰察布","巴彦淖尔","兴安盟","锡林郭勒盟","阿拉善盟"]);
dsy.add("0_7",["沈阳","朝阳","阜新","铁岭","抚顺","本溪","辽阳","鞍山","丹东","大连","营口","盘锦","锦州","葫芦岛"]);
dsy.add("0_8",["长春","白城","松原","吉林","四平","辽源","通化","白山","延边"]);
dsy.add("0_9",["哈尔滨","齐齐哈尔","七台河","黑河","大庆","鹤岗","伊春","佳木斯","双鸭山","鸡西","牡丹江","绥化","大兴安岭"]);
dsy.add("0_10",["南京","徐州","连云港","宿迁","淮安","盐城","扬州","泰州","南通","镇江","常州","无锡","苏州"]);
dsy.add("0_11",["杭州","湖州","嘉兴","舟山","宁波","绍兴","衢州","金华","台州","温州","丽水"]);
dsy.add("0_12",["合肥","宿州","淮北","亳州","阜阳","蚌埠","淮南","滁州","马鞍山","芜湖","铜陵","安庆","黄山","六安","巢湖","池州","宣城"]);
dsy.add("0_13",["福州","南平","莆田","三明","泉州","厦门","漳州","龙岩","宁德"]);
dsy.add("0_14",["南昌","九江","景德镇","鹰潭","新余","萍乡","赣州","上饶","抚州","宜春","吉安"]);
dsy.add("0_15",["济南","青岛","聊城","德州","东营","淄博","潍坊","烟台","威海","日照","临沂","枣庄","济宁","泰安","莱芜","滨州","菏泽"]);
dsy.add("0_16",["郑州","开封","三门峡","洛阳","焦作","新乡","鹤壁","安阳","濮阳","商丘","许昌","漯河","平顶山","南阳","信阳","周口","驻马店","济源"]);
dsy.add("0_17",["武汉","十堰","襄樊","荆门","孝感","黄冈","鄂州","黄石","咸宁","荆州","宜昌","随州","恩施"]);
dsy.add("0_18",["长沙","张家界","常德","益阳","岳阳","株洲","湘潭","衡阳","郴州","永州","邵阳","怀化","娄底","湘西"]);
dsy.add("0_19",["广州","深圳","清远","韶关","河源","梅州","潮州","汕头","揭阳","汕尾","惠州","东莞","珠海","中山","江门","佛山","肇庆","云浮","阳江","茂名","湛江"]);
dsy.add("0_20",["南宁","桂林","柳州","梧州","贵港","玉林","钦州","北海","防城港","崇左","百色","河池","来宾","贺州"]);
dsy.add("0_21",["海口","三亚","三沙","儋州"]);
dsy.add("0_22",["成都","广元","绵阳","德阳","南充","广安","遂宁","内江","乐山","自贡","泸州","宜宾","攀枝花","巴中","达州","资阳","眉山","雅安","阿坝","甘孜","凉山"]);
dsy.add("0_23",["贵阳","六盘水","遵义","安顺","毕节地区","铜仁","黔东南","黔南自治州","黔西南"]);
dsy.add("0_24",["昆明","曲靖","玉溪","保山","昭通","丽江","思茅","临沧","德宏","怒江","迪庆","大理自治州","楚雄自治州","红河","文山","西双版纳"]);
dsy.add("0_25",["拉萨","那曲","昌都","林芝","山南","日喀则","阿里"]);
dsy.add("0_26",["西安","延安","铜川","渭南","咸阳","宝鸡","汉中","榆林","安康","商洛"]);
dsy.add("0_27",["兰州","嘉峪关","白银","天水","武威","酒泉","张掖","庆阳","平凉","定西","陇南","临夏","甘南"]);
dsy.add("0_28",["西宁","海东","海北","海南","黄南","果洛","玉树","海西"]);
dsy.add("0_29",["银川","石嘴山","吴忠","固原","中卫"]);
dsy.add("0_30",["乌鲁木齐","克拉玛依","吐鲁番","哈密","阿克苏","喀什","和田","昌吉回族","博尔塔拉蒙古","巴音郭楞蒙古","克孜勒苏柯尔克孜","伊犁哈萨克"]);
// dsy.add("0_31",["香港特别行政区"]);
// dsy.add("0_32",["澳门特别行政区"]);
// dsy.add("0_33",["台北","高雄","台中","花莲","基隆","嘉义","金门","连江","苗栗","南投","澎湖","屏东","台东","台南","桃园","新竹","宜兰","云林","彰化"]);
dsy.add("0",["北京","天津","上海","重庆","河北","山西","内蒙古","辽宁","吉林","黑龙江","江苏","浙江","安徽","福建","江西","山东","河南","湖北","湖南","广东","广西","海南","四川","贵州","云南","西藏","陕西","甘肃","青海","宁夏","新疆"]);

var s=["s_province","s_city"];//2个select的name
var opt0 = ["省份","地级市"];//初始值
function _init_area(){ //初始化函数
    for(var i=0;i<s.length-1;i++){
        document.getElementById(s[i]).onchange=new Function("change("+(i+1)+")");
    }
    change(0);
}